#include <iostream>
/*
 * На этот раз вам нужно проверить, задает ли введенная пользователем строка корректный IP-адрес.
 * IP-адрес должен представлять из себя 4 числа, разделенных точками без пробелов,
 * причем каждое число должно быть в диапазоне от 0 до 255 включительно.
 * Числа не должны содержать ведущих нулей. Других символов в строке, кроме вышеописанных, присутствовать не должно.
 * Пользователь вводит строку, задающую email-адрес.
 * Программа должна вывести слово Yes, если адрес корректен, а в противном случае - слово No.
 */

int main() {
    std::cout << "Hello, World!" << std::endl;
    return 0;
}
